In [400]:
import numpy as np
import pandas as pd

In [448]:
# Read in the data
data = pd.read_csv('UVM_pay_19.csv',
                  names=["Name", "Position", "Salary"])

check_gender = pd.read_csv('baby-names.csv',
                    names = ["Name", "Gender"])

In [449]:
# Find index where salary data was not avaliable
remove = []
data[data.Salary.isnull()]
for row in data[data.Salary.isnull()].index:
    remove.append(row)

In [450]:
# Find bad index
data[data.Salary == 'Base Pay']
for row in data[data.Salary == 'Base Pay'].index:
    remove.append(row)

In [451]:
# Reverse the order to remove the lowest rows first
remove.sort(reverse = True)

In [452]:
len(data)

4242

In [453]:
# Remove all entries found to not contain salary data
for i in remove:
    data = data.drop(i)

In [454]:
len(data)

4004

In [455]:
# Remove none int char from Salary data and convert from str to int
data.Salary = data.Salary.str.replace("$","")
data.Salary = data.Salary.str.replace(",","")
data.Salary = data.Salary.astype(int)

In [456]:
# Who makes more than $200,000
data[data.Salary > 200000]

                       Name                   Position  Salary
101               An,Gary C            Professor (COM)  210000
103        Ananou,T. Simeon  Chief Information Officer  239700
137         Atherly,Adam J.                  Professor  260100
250          Becker,John E.     Athletic Head Coach Sr  318270
259     Belliveau,Cynthia L                       Dean  206467
...                     ...                        ...     ...
3925  Vigoreaux,Jim Osvaldo          Associate Provost  205497
3936    Vizzard,Margaret A.                  Professor  247331
4003  Warshaw,David Michael                  Professor  368579
4205          Zakai,Neil A.        Associate Professor  220000
4214    Zehle,Christa Maria     Interim Associate Dean  295342

[66 rows x 3 columns]

In [457]:
# Creates a list for non-repeat job titles
job_list = []

for job in data.Position:
    if job not in job_list:
        job_list.append(job)
len(job_list)

250

In [458]:
# Create a list of all Last names from the Name column in dataframe
last_Name = []
for name in data.Name:
    char_hold = str('')
    cnt = 0
    for char in name:
        if char == ',':
            last_Name.append(char_hold)
            char_hold = str('')
            break
        char_hold += char

In [459]:
# Create a list of all first names
first_Name = []
for name in data.Name:
    char_hold = str('')
    cnt = 0
    for char in name:
        if char == ' ':
            first_Name.append(char_hold)
            break
        char_hold += char
        if char == ',':
            char_hold = str('')
            
            
        
        
        cnt += 1
        
        
        if cnt == len(name):
            first_Name.append(char_hold)
            break

In [460]:
# Sanity check
print(len(first_Name))
print(len(last_Name))
print(len(data))

4004
4004
4004

In [461]:
# Add the new columns to the dataframe
data['First_Name'] = first_Name
data['Last_Name'] = last_Name

In [462]:
# Remove the Full name column
data = data.drop(columns="Name")

In [463]:
data

                            Position  Salary First_Name Last_Name
10               Associate Professor   67200      Jamie    Abaied
11    Office/Prgm Support Generalist   28219    Shirley     Abair
12                          Lecturer   53612    Michael   Abajian
13    Office/Prgm Support Generalist   45766       Lori    Abbott
14         Assistant Professor (COM)   30000       Rany  Abdallah
...                              ...     ...        ...       ...
4237    Custodial Maintenance Worker   30846     Ferida      Zolj
4238                 Professor (COM)   35000    Richard   Zubarik
4239       Assistant Professor (COM)   30000  Cassandra  Zurawsky
4240      Info Tech Assist/Programmr   46944      Molly  Zurheide
4241   Custodial Maintenance Spec Sr   35651      Ramiz    Zvekic

[4004 rows x 4 columns]

In [464]:
data[data.Last_Name == "Frolik"]

       Position  Salary First_Name Last_Name
1354  Professor  160961       Jeff    Frolik

In [465]:
data[data.First_Name == 'Jeff']

                            Position  Salary First_Name   Last_Name
565                        Professor  139726       Jeff       Buzas
1213           Outreach Professional   52038       Jeff    Falsgraf
1354                       Professor  160961       Jeff      Frolik
2134        Technical Safety Officer   86062       Jeff  LaBossiere
3245  Administrative Professional Sr   73758       Jeff      Rogers

In [489]:
# Creates a list for non-repeat job titles
name_list = []
index_list = []
for i,name in enumerate(check_gender.Name):
    if name not in name_list:
        name_list.append(name)
        index_list.append(i)
len(name_list)

6783

In [493]:
gender_list =[]
for i in index_list:
    gender_list.append(check_gender.Gender[i])

In [513]:
Gender = []
test = len(gender_list)-1
for name in data.First_Name:
    cnt = 0
    for j,check_name in enumerate(name_list):
        if name.lower() == check_name.lower():
            Gender.append(gender_list[j])
            break
        if j == test:
            Gender.append("N/a")

In [514]:
len(Gender)

4004

In [515]:
data['Gender'] = Gender

In [516]:
data

                            Position  Salary First_Name Last_Name Gender
10               Associate Professor   67200      Jamie    Abaied    boy
11    Office/Prgm Support Generalist   28219    Shirley     Abair    boy
12                          Lecturer   53612    Michael   Abajian    boy
13    Office/Prgm Support Generalist   45766       Lori    Abbott   girl
14         Assistant Professor (COM)   30000       Rany  Abdallah    N/a
...                              ...     ...        ...       ...    ...
4237    Custodial Maintenance Worker   30846     Ferida      Zolj    N/a
4238                 Professor (COM)   35000    Richard   Zubarik    boy
4239       Assistant Professor (COM)   30000  Cassandra  Zurawsky   girl
4240      Info Tech Assist/Programmr   46944      Molly  Zurheide   girl
4241   Custodial Maintenance Spec Sr   35651      Ramiz    Zvekic    N/a

[4004 rows x 5 columns]

In [534]:
boys = 0
girls = 0
g_sal = 0
b_sal = 0
Salary_np = data.Salary.to_numpy()
for i, gender in enumerate(data.Gender):
    if gender == "girl":
        girls += 1
        g_sal += Salary_np[i]
    if gender == "boy":
        boys += 1
        b_sal += Salary_np[i]

In [538]:
print(girls)
print(g_sal/girls)

782
59089.01150895141

In [539]:
print(boys)
print(b_sal/boys)

2658
66227.6813393529

In [537]:
print((g_sal/girls)/(b_sal/boys))

0.8922101803047776